app/views/genres/show.html.erb

SELECT "works".* FROM "works" INNER JOIN "genres_works" ON "works"."id" = "genres_works"."work_id" WHERE "genres_works"."genre_id" = $1  [["genre_id", 21]]
---
<ul>
<% @genre.works.each do |work| %>