app/views/works/_form.html.erb

  <strong>Genre 2</strong>
  <% Genre.all.each do |genre| %>
---
SELECT "genres".* FROM "genres"