app/views/works/index.html.erb

     <%= f.label :trait, 'Traits' %>
     <%= f.select :trait , Property.pluck(:trait).uniq %>
---
SELECT "properties"."trait" FROM "properties"