app/views/works/show.html.erb

SELECT "genres".* FROM "genres" INNER JOIN "genres_works" ON "genres"."id" = "genres_works"."genre_id" WHERE "genres_works"."work_id" = $1  [["work_id", 292]]
---
    <div class="genre">
      <% @work.genres.each do |genre| %>