app/views/works/show.html.erb

SELECT "properties".* FROM "properties" WHERE "properties"."work_id" = $1  [["work_id", 292]]
---
    <br>
    <% @work.properties.each do |property| %>

SELECT  "bids".* FROM "bids" WHERE "bids"."work_id" = $1 ORDER BY "bids"."id" DESC LIMIT $2  [["work_id", 292], ["LIMIT", 5]]
---
  <br>
  <% @work.bids.last(5).each do |i| %>