app/views/works/show.html.erb

    <div class="genre">
      <% @work.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_works" ON "genres"."id" = "genres_works"."genre_id" WHERE "genres_works"."work_id" = $1  [["work_id", 359]]

      <br>
      <% @work.properties.each do |property| %>
---
SELECT "properties".* FROM "properties" WHERE "properties"."work_id" = $1  [["work_id", 249]]

      <tr>
      <% @work.bids.last(5).each do |i| %>
---
SELECT  "bids".* FROM "bids" WHERE "bids"."work_id" = $1 ORDER BY "bids"."id" DESC LIMIT $2  [["work_id", 363], ["LIMIT", 5]]