app/views/users/show.html.erb

<ul>
<% @user.works.each do |work| %>
---
SELECT "works".* FROM "works" WHERE "works"."user_id" = $1  [["user_id", 6]]