app/controllers/bids_controller.rb

SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 292], ["LIMIT", 1]]
---
  def new
    @bid = Bid.new
    @work = Work.find params[:id]

INSERT INTO "bids" ("currency", "created_at", "updated_at", "price", "work_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["currency", "Etherum"], ["created_at", "2022-08-30 00:59:11.270694"], ["updated_at", "2022-08-30 00:59:11.270694"], ["price", 1.0], ["work_id", 292], ["user_id", 81]]
UPDATE "works" SET "user_id" = $1, "updated_at" = $2 WHERE "works"."id" = $3  [["user_id", 81], ["updated_at", "2022-08-30 01:40:21.926510"], ["id", 292]]
---
      #transfer ownship

      @new_bid.work.user_id = @current_user.id
      @new_bid.work.save