app/controllers/genres_controller.rb

  def index
    @genre = Genre.all
---
SELECT "genres".* FROM "genres"

  def show
    @genre = Genre.find params[:id]
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 77], ["LIMIT", 1]]