app/controllers/search_controller.rb

  def index

    # Below is defining the term search as a params
      search = "%" + params[:search] + "%"
      # params search is cpmpared to the terms within the different Work within the name, description and artist information
      @works = Work.where("name ILIKE ? OR description ILIKE ? OR artist ILIKE ?", search, search, search)
---
SELECT "works".* FROM "works" WHERE (name ILIKE '%monkey%' OR description ILIKE '%monkey%' OR artist ILIKE '%monkey%')