app/controllers/session_controller.rb

  def create
    # 1. Check that the email address entered is actually in the DB
    user = User.find_by email: params[:email]

    # 2. correct password for this email address?
    if user.present? && user.authenticate(params[:password] )
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "monkey@gmail.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "spohie@gmail.com"], ["LIMIT", 1]]