app/controllers/users_controller.rb

  def edit
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]