app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.create user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "works".* FROM "works" WHERE "works"."user_id" = $1  [["user_id", 6]]
---
  def show
    @user = User.find params[:id]
    @work = Work.all