app/controllers/works_controller.rb

  def new

    @work = Work.new
    @genre = Genre.all
---
SELECT "genres"."id" FROM "genres"

  def create
    @bid = Bid.new bid_params
    @work = Work.new work_params
    @work.user_id = @current_user.id
    @work.save

    if @work.persisted?
      # Associate the genre with the work created
      # @genre = Genre.find params[:genre][:ids]
      # @work.genres << Genre.find params[:genre_ids]

      @work.genres << Genre.find(params[:genre_ids])

      @property = Property.create!(

        trait: params[:trait],
        trait_value: params[:trait_value],
        percentage: params[:percentage],
        work_id: @work.id
      )
      @property1 = Property.create!(
        trait: params[:trait1],
        trait_value: params[:trait_value1],
        percentage: params[:percentage1],
        work_id: @work.id
      )
---
INSERT INTO "works" ("name", "description", "artist", "blockchain", "currency", "picture", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN ($1, $2)  [["id", 21], ["id", 22]]
INSERT INTO "properties" ("trait", "trait_value", "work_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["trait", ""], ["trait_value", ""], ["work_id", 256], ["created_at", "2022-08-29 05:11:59.027996"], ["updated_at", "2022-08-29 05:11:59.027996"]]
INSERT INTO "properties" ("trait", "trait_value", "work_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["trait", ""], ["trait_value", ""], ["work_id", 320], ["created_at", "2022-08-31 06:30:16.564572"], ["updated_at", "2022-08-31 06:30:16.564572"]]

  def index
    # change to works
    @works = Work.all
---
SELECT "works".* FROM "works" WHERE (name like '%# {params[:search_by_name]}%')

  def show
    @work = Work.find params[:id]
    @property = Property.all
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 308], ["LIMIT", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."work_id" = $1  [["work_id", 212]]

  def edit
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 308], ["LIMIT", 1]]

  def update
    @work = Work.find params[:id]

    if @work.user_id != @current_user.id
      redirect_to login_path
      return
    end

    if @work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 314], ["LIMIT", 1]]
UPDATE "works" SET "artist" = $1, "user_id" = $2, "updated_at" = $3 WHERE "works"."id" = $4  [["artist", "Sophie1"], ["user_id", 1], ["updated_at", "2022-08-27 12:37:50.100830"], ["id", 1]]