app/controllers/works_controller.rb

SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 218], ["LIMIT", 1]]
---
  def create
    # Allows users to create bids on show page and also work
    @bid = Bid.new @bid_params
    @work = Work.new work_params
    @work.user_id = @current_user.id

    if params[:work][:picture].present?
      # Upload to cloudinary
      response = Cloudinary::Uploader.upload params[:work][:picture]
      @work.picture = response["public_id"]
    end

    @work.save

    # If work is created with the above form, the below variable genres and properties are also saved as new with the same assoications
    if @work.persisted?
      # Associate the genre with the work created
      # @genre = Genre.find params[:genre][:ids]
      # @work.genres << Genre.find params[:genre_ids]
      if @work.genres.present?
      @work.genres << Genre.find(params[:genre_ids])